In [1]:
import numpy as np
import pandas as pd

# Concat

In [2]:
# https://pandas.pydata.org/docs/user_guide/merging.html

In [3]:
# simple stacking
# concat is not an Intelligent process

In [4]:
a = pd.read_csv('a.csv')

In [7]:
a

    A   B
0  10  20
1  30  40

In [8]:
b = pd.read_csv('b.csv')
b

    A   C
0  10  20
1  30  40

In [9]:
# to concat two tables use concat([]), wrap table name in list
pd.concat([a,b])
# it will simply add two table in top to bottom manner and which field is not present it will return none

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [10]:
pd.concat([a,b],axis = 0)
# defalut axis is 0

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [11]:
# change the default axis to 1
data = pd.concat([a,b],axis = 1)
data
# it will join table in left to right manner

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [13]:
# slicing
# to get data all of row i.e, two row and columns 2nd and 3rd
data.iloc[:,1:3]

    B   A
0  20  10
1  40  30

# Join

In [14]:
pd.concat([a,b],axis = 1)

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [16]:
# default value of join =  outer join
pd.concat([a,b])

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [17]:
# default value of join =  outer join
pd.concat([a,b],join='outer')
# outer join will give all matched and non matched data of two tables

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [19]:
pd.concat([a,b],join = 'inner')
# inner join will give common values in two tables

    A
0  10
1  30
0  10
1  30

# Merge

In [20]:
a

    A   B
0  10  20
1  30  40

In [21]:
b

    A   C
0  10  20
1  30  40

In [22]:
pd.merge(a,b)
# merge will act intelligently and return only distinct columns in o/p i.e column a is common is both table so it will redundant and keep only one

    A   B   C
0  10  20  20
1  30  40  40

In [25]:
pd.merge(b,a)
# if you change squence of table in merging it will give o/p accordinglly table squence, sequence changed

    A   C   B
0  10  20  20
1  30  40  40

In [26]:
a.merge(b)
# will give same o/p as pd.merge(a,b)

    A   B   C
0  10  20  20
1  30  40  40

In [27]:
b.merge(a)
# will give same o/p as pd.merge(b,a)

    A   C   B
0  10  20  20
1  30  40  40

In [28]:
a.merge(b)

    A   B   C
0  10  20  20
1  30  40  40

#### preferred operation is 'MERGING'